app/controllers/clients_controller.rb

def show
  id = params[:id]
  @client = Client.find(params[:id])
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 1]]

	def create
		client_params = params.require(:client).permit(:firstname, :lastname, :email, :password)

    @client = Client.create(client_params)
---
INSERT INTO "clients" ("firstname", "lastname", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

	def edit #has views
    id = params[:id]
      @client = Client.find(id)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@client = Client.find(params[:id])
  if @client.update(client_params)
---
SELECT  "clients".* FROM "clients" WHERE "clients"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "clients" SET "firstname" = $1, "updated_at" = $2 WHERE "clients"."id" = $3  [["firstname", "hahaha,,,ll"], ["updated_at", "2015-10-04 08:14:15.377218"], ["id", 2]]